# Методы строк:
#
# Задача 1.Напишите программу, которая преобразует строку в верхний регистр.
#
# str = "anatoli"
# print(str.upper())
#
# Задача 2. Напишите программу, которая проверяет, начинается ли строка с определенной подстроки.
#
# str = "Anatoli live"
# print(str.startswith('Anatoli'))
# print(str.startswith('live'))

# Задача  3. Напишите программу, которая заменяет все вхождения одной подстроки на другую в строке.

# str = "Это строка будет первой."
# print(str.replace('первой', 'второй'))

# Задача 4. Напишите программу, которая разбивает строку на список подстрок по определенному разделителю.

# str = "Я люблю программировать!"
# print(str.split())

# Задача 5. Напишите программу, которая удаляет лишние пробелы в начале и конце строки.

# str = "  I love IT     "
# print(str.split())