# Методы списков:

# Задач 6. Напишите программу, которая добавляет элемент в конец списка.

# list = [1, 2, 3, 4, 5]
# list.append('IT')
# print(list)

# Задача 7. Напишите программу, которая удаляет элемент из списка по значению.

# list = [1, 2, 3, 4, 5]
# list.remove(3)
# print(list)

# Задача 8. Напишите программу, которая сортирует список по возрастанию.

# list = [5, 3, 6, 2, 1, 7, 8, 9, 4]
# list.sort()
# print(list)

# Задача 9. Напишите программу, которая находит индекс первого вхождения элемента в списке.

list = [1, 2, 3, 4, 5]
print(list)
print(list.index(2))

# Задача 10. Напишите программу, которая объединяет два списка в один.

# list = [1, 2, 3, 4, 5]
# list_two = [6, 7, 8, 9, 10]
# print(list + list_two)

