# Методы словарей

# Задача 11. Напишите программу, которая добавляет новую пару ключ-значение в словарь.

# dict = {}
# dict['price'] = 1000
# print(dict)

# Задача 12. Напишите программу, которая удаляет пару ключ-значение из словаря по ключу.

# dict = {'price': 1000}
# print(dict)
# del dict['price']
# print(dict)

# Задача 13. Напишите программу, которая проверяет, есть ли определенный ключ в словаре.

# dict = {'price': 1000,
#         'auto': 'Mazda',
#         'password': 26
#         }
# print(dict.get('auto'))

# Задача 14. Напишите программу, которая выводит все ключи словаря.

# dict = {'price': 1000,
#         'auto': 'Mazda',
#         'password': 26
#         }
# print(dict.keys())

# Задача 15. Напишите программу, которая выводит все значения словаря.

# dict = {'price': 1000,
#         'auto': 'Mazda',
#         'password': 26
#         }
# print(dict.values())